ХМНПФ_Общее/DataProcessors/уп_НачислениеНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_НачислениеНДФЛ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_НачисленияПенсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_НачисленияПенсий</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговаяБазаПоНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДнейВПериоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчетаНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерваНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПенсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_ПрочиеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПрочиеНачисления</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговаяБазаПоНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыВыплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_ПрочиеНачисленияОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПрочиеНачисленияОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговаяБазаПоНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыВыплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Решение</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ВидыДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ВидыДеятельности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/пдс_ТипыЗаявленияНаВыкупнуюСумму.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>пдс_ТипыЗаявленияНаВыкупнуюСумму</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоОсобымОбстоятельствам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыВыплат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПенсий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереводВДругойПФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыРасторженцам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплатаОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПенсийОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратМатеринскогоКапитала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрочнаяПенсияОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратВыплатПравопреемникамОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратЕдиновременнойВыплатыОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратНакопительнойПенсииОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратСрочнойПенсииОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратПенсииНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратВыплатНаследникамНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратВыплатРасторженцамНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыНаследникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереводВДругойНПФ_НПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыНаследникамОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежПенсияНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежРасторжениеНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежПравопреемникиНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежНПОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежСВОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежЕВОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежПравопреемникиОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазделениеСНИЛС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_НачислениеНДФЛ/Forms/уф_Форма/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("СформироватьТЗДокумента")
Процедура НПФ_СформироватьТЗДокумента(ТЗДокумента)
	
	#Вставка
	// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
	хм_Ускорение = Неопределено;
	#КонецВставки
	Если Переключатель1 = 0 Тогда
		Если ВключатьТолькоПСДокументов Тогда 
			//составим список регистраторов
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ВЫБОР КОГДА &ВключатьПР ТОГДА НачислениеПенсий.Ссылка ИНАЧЕ NULL КОНЕЦ КАК Ссылка
			|ИЗ
			|	Документ.уп_НачислениеПенсий КАК НачислениеПенсий
			|ГДЕ
			|	НачислениеПенсий.Дата >= &ДатаНач
			|	И НачислениеПенсий.Организация = &Организация
			|	И НачислениеПенсий.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР КОГДА &ВключатьПР ТОГДА уп_ДополнительнаяВыплатаПравопреемникам.Ссылка ИНАЧЕ NULL КОНЕЦ 
			|ИЗ
			|	Документ.уп_ДополнительнаяВыплатаПравопреемникам КАК уп_ДополнительнаяВыплатаПравопреемникам
			|ГДЕ
			|	уп_ДополнительнаяВыплатаПравопреемникам.Организация = &Организация
			|	И уп_ДополнительнаяВыплатаПравопреемникам.Дата >= &ДатаНач
			|	И уп_ДополнительнаяВыплатаПравопреемникам.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР КОГДА &ВключатьОПС ТОГДА РешениеОВыплате.Ссылка ИНАЧЕ NULL КОНЕЦ
			|ИЗ
			|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений КАК РешениеОВыплате
			|ГДЕ
			|	РешениеОВыплате.Организация = &Организация
			|	И РешениеОВыплате.Дата >= &ДатаНач
			|	И РешениеОВыплате.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР КОГДА &ВключатьПР ТОГДА уп_НачислениеОстатковПоРасторгнутымДоговорамНПО.Ссылка ИНАЧЕ NULL КОНЕЦ 
			|ИЗ
			|	Документ.уп_НачислениеОстатковПоРасторгнутымДоговорамНПО КАК уп_НачислениеОстатковПоРасторгнутымДоговорамНПО
			|ГДЕ
			|	уп_НачислениеОстатковПоРасторгнутымДоговорамНПО.Организация = &Организация
			|	И уп_НачислениеОстатковПоРасторгнутымДоговорамНПО.Дата >= &ДатаНач
			|	И уп_НачислениеОстатковПоРасторгнутымДоговорамНПО.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР КОГДА &ВключатьПР ТОГДА ЗакрытиеСчетов.Ссылка ИНАЧЕ NULL КОНЕЦ 
			|ИЗ
			|	Документ.уп_ЗакрытиеСчетов КАК ЗакрытиеСчетов
			|ГДЕ
			|	ЗакрытиеСчетов.Организация = &Организация
			|	И ЗакрытиеСчетов.Дата >= &ДатаНач
			|	И ЗакрытиеСчетов.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР КОГДА &ВключатьПР ТОГДА уп_ЗакрытиеДоговораВПользуТретьихЛиц.Ссылка ИНАЧЕ NULL КОНЕЦ 
			|ИЗ
			|	Документ.уп_ЗакрытиеДоговораВПользуТретьихЛиц КАК уп_ЗакрытиеДоговораВПользуТретьихЛиц
			|ГДЕ
			|	уп_ЗакрытиеДоговораВПользуТретьихЛиц.Организация = &Организация
			|	И уп_ЗакрытиеДоговораВПользуТретьихЛиц.Дата >= &ДатаНач
			|	И уп_ЗакрытиеДоговораВПользуТретьихЛиц.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР КОГДА &ВключатьПР ТОГДА уп_НачислениеНаследнику.Ссылка ИНАЧЕ NULL КОНЕЦ 
			|ИЗ
			|	Документ.уп_НачислениеНаследнику КАК уп_НачислениеНаследнику
			|ГДЕ
			|	уп_НачислениеНаследнику.Организация = &Организация
			|	И уп_НачислениеНаследнику.Дата >= &ДатаНач
			|	И уп_НачислениеНаследнику.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР КОГДА &ВключатьПДС ТОГДА пдс_РешениеОВыплатеВыкупнойСуммы.Ссылка ИНАЧЕ NULL КОНЕЦ 
			|ИЗ
			|	Документ.пдс_РешениеОВыплатеВыкупнойСуммы КАК пдс_РешениеОВыплатеВыкупнойСуммы
			|ГДЕ
			|	пдс_РешениеОВыплатеВыкупнойСуммы.Организация = &Организация
			|	И пдс_РешениеОВыплатеВыкупнойСуммы.Дата >= &ДатаНач
			|	И пдс_РешениеОВыплатеВыкупнойСуммы.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР КОГДА &ВключатьПДС ТОГДА пдс_РешениеОВыплатеПравопреемникамПДС.Ссылка ИНАЧЕ NULL КОНЕЦ 
			|ИЗ
			|	Документ.пдс_РешениеОВыплатеПравопреемникамПДС КАК пдс_РешениеОВыплатеПравопреемникамПДС
			|ГДЕ
			|	пдс_РешениеОВыплатеПравопреемникамПДС.Организация = &Организация
			|	И пдс_РешениеОВыплатеПравопреемникамПДС.Дата >= &ДатаНач
			|	И пдс_РешениеОВыплатеПравопреемникамПДС.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР КОГДА &ВключатьПДС ТОГДА пдс_РешениеОЕдиновременнойВыплатеПДС.Ссылка ИНАЧЕ NULL КОНЕЦ 
			|ИЗ
			|	Документ.пдс_РешениеОЕдиновременнойВыплатеПДС КАК пдс_РешениеОЕдиновременнойВыплатеПДС
			|ГДЕ
			|	пдс_РешениеОЕдиновременнойВыплатеПДС.Организация = &Организация
			|	И пдс_РешениеОЕдиновременнойВыплатеПДС.Дата >= &ДатаНач
			|	И пдс_РешениеОЕдиновременнойВыплатеПДС.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР КОГДА &ВключатьПДС ТОГДА пдс_НачислениеПенсийПДС.Ссылка ИНАЧЕ NULL КОНЕЦ 
			|ИЗ
			|	Документ.пдс_НачислениеПенсийПДС КАК пдс_НачислениеПенсийПДС
			|ГДЕ
			|	пдс_НачислениеПенсийПДС.Дата >= &ДатаНач
			|	И пдс_НачислениеПенсийПДС.Организация = &Организация
			|	И пдс_НачислениеПенсийПДС.Дата <= &ДатаКон";	   
			
			Запрос.УстановитьПараметр("Организация", Объект.Организация);
			Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.ДатаДокументовНачисления));
			Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.ДатаДокументовНачисления)); 
			Если НЕ ЗначениеЗаполнено(Объект.Модуль) Тогда
				Запрос.УстановитьПараметр("ВключатьПР", Истина);
				Запрос.УстановитьПараметр("ВключатьОПС", Истина); 
				Запрос.УстановитьПараметр("ВключатьПДС", Истина); 
			Иначе
				Запрос.УстановитьПараметр("ВключатьПР", Объект.Модуль = Перечисления.уп_ВидыДеятельности.ПР);
				Запрос.УстановитьПараметр("ВключатьОПС", Объект.Модуль = Перечисления.уп_ВидыДеятельности.ОПС); 
				Запрос.УстановитьПараметр("ВключатьПДС", Объект.Модуль = Перечисления.уп_ВидыДеятельности.ПДС); 
			КонецЕсли;	
			
			СписокРегистраторов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"); 
				
		Иначе
			//составим список Участников
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ВключатьПР
			|			ТОГДА НачислениеПенсийСписокПенсионеров.НомерСчета.Участник
			|		ИНАЧЕ NULL
			|	КОНЕЦ КАК Участник
			|ИЗ
			|	Документ.уп_НачислениеПенсий.СписокПенсионеров КАК НачислениеПенсийСписокПенсионеров
			|ГДЕ
			|	НачислениеПенсийСписокПенсионеров.Ссылка.Дата >= &ДатаНач
			|	И НачислениеПенсийСписокПенсионеров.Ссылка.Организация = &Организация
			|	И НачислениеПенсийСписокПенсионеров.Ссылка.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ВключатьПР
			|			ТОГДА уп_ДополнительнаяВыплатаПравопреемникамЗаявления.Правопреемник
			|		ИНАЧЕ NULL
			|	КОНЕЦ
			|ИЗ
			|	Документ.уп_ДополнительнаяВыплатаПравопреемникам.Заявления КАК уп_ДополнительнаяВыплатаПравопреемникамЗаявления
			|ГДЕ
			|	уп_ДополнительнаяВыплатаПравопреемникамЗаявления.Ссылка.Организация = &Организация
			|	И уп_ДополнительнаяВыплатаПравопреемникамЗаявления.Ссылка.Дата >= &ДатаНач
			|	И уп_ДополнительнаяВыплатаПравопреемникамЗаявления.Ссылка.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ВключатьОПС
			|			ТОГДА РешениеОВыплатеЗаявления.Правопреемник
			|		ИНАЧЕ NULL
			|	КОНЕЦ
			|ИЗ
			|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК РешениеОВыплатеЗаявления
			|ГДЕ
			|	РешениеОВыплатеЗаявления.Ссылка.Организация = &Организация
			|	И РешениеОВыплатеЗаявления.Ссылка.Дата >= &ДатаНач
			|	И РешениеОВыплатеЗаявления.Ссылка.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ВключатьПР
			|			ТОГДА уп_НачислениеОстатковПоРасторгнутымДоговорамНПОПолучатели.Участник
			|		ИНАЧЕ NULL
			|	КОНЕЦ
			|ИЗ
			|	Документ.уп_НачислениеОстатковПоРасторгнутымДоговорамНПО.ПенсионныеСчета КАК уп_НачислениеОстатковПоРасторгнутымДоговорамНПОПолучатели
			|ГДЕ
			|	уп_НачислениеОстатковПоРасторгнутымДоговорамНПОПолучатели.Ссылка.Организация = &Организация
			|	И уп_НачислениеОстатковПоРасторгнутымДоговорамНПОПолучатели.Ссылка.Дата >= &ДатаНач
			|	И уп_НачислениеОстатковПоРасторгнутымДоговорамНПОПолучатели.Ссылка.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ВключатьПР
			|			ТОГДА ЗакрытиеСчетовПолучатели.Получатель
			|		ИНАЧЕ NULL
			|	КОНЕЦ
			|ИЗ
			|	Документ.уп_ЗакрытиеСчетов.Получатели КАК ЗакрытиеСчетовПолучатели
			|ГДЕ
			|	ЗакрытиеСчетовПолучатели.Ссылка.Организация = &Организация
			|	И ЗакрытиеСчетовПолучатели.Ссылка.Дата >= &ДатаНач
			|	И ЗакрытиеСчетовПолучатели.Ссылка.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ВключатьПР
			|			ТОГДА уп_ЗакрытиеДоговораВПользуТретьихЛицПолучатели.Получатель
			|		ИНАЧЕ NULL
			|	КОНЕЦ
			|ИЗ
			|	Документ.уп_ЗакрытиеДоговораВПользуТретьихЛиц.Получатели КАК уп_ЗакрытиеДоговораВПользуТретьихЛицПолучатели
			|ГДЕ
			|	уп_ЗакрытиеДоговораВПользуТретьихЛицПолучатели.Ссылка.Организация = &Организация
			|	И уп_ЗакрытиеДоговораВПользуТретьихЛицПолучатели.Ссылка.Дата >= &ДатаНач
			|	И уп_ЗакрытиеДоговораВПользуТретьихЛицПолучатели.Ссылка.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ВключатьПР
			|			ТОГДА уп_НачислениеНаследнику.Правопреемник
			|		ИНАЧЕ NULL
			|	КОНЕЦ
			|ИЗ
			|	Документ.уп_НачислениеНаследнику КАК уп_НачислениеНаследнику
			|ГДЕ
			|	уп_НачислениеНаследнику.Ссылка.Организация = &Организация
			|	И уп_НачислениеНаследнику.Ссылка.Дата >= &ДатаНач
			|	И уп_НачислениеНаследнику.Ссылка.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ВключатьПДС
			|			ТОГДА пдс_НачислениеПенсийПДССписокПенсионеров.НомерСчета.Участник
			|		ИНАЧЕ NULL
			|	КОНЕЦ
			|ИЗ
			|	Документ.пдс_НачислениеПенсийПДС.СписокПенсионеров КАК пдс_НачислениеПенсийПДССписокПенсионеров
			|ГДЕ
			|	пдс_НачислениеПенсийПДССписокПенсионеров.Ссылка.Дата >= &ДатаНач
			|	И пдс_НачислениеПенсийПДССписокПенсионеров.Ссылка.Организация = &Организация
			|	И пдс_НачислениеПенсийПДССписокПенсионеров.Ссылка.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ВключатьПДС
			|			ТОГДА РешениеОВыплатеПравопреемникамПДСЗаявления.Правопреемник
			|		ИНАЧЕ NULL
			|	КОНЕЦ
			|ИЗ
			|	Документ.пдс_РешениеОВыплатеПравопреемникамПДС.Заявления КАК РешениеОВыплатеПравопреемникамПДСЗаявления
			|ГДЕ
			|	РешениеОВыплатеПравопреемникамПДСЗаявления.Ссылка.Организация = &Организация
			|	И РешениеОВыплатеПравопреемникамПДСЗаявления.Ссылка.Дата >= &ДатаНач
			|	И РешениеОВыплатеПравопреемникамПДСЗаявления.Ссылка.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ВключатьПДС
			|			ТОГДА пдс_РешениеОЕдиновременнойВыплатеПДС.Участник
			|		ИНАЧЕ NULL
			|	КОНЕЦ
			|ИЗ
			|	Документ.пдс_РешениеОЕдиновременнойВыплатеПДС КАК пдс_РешениеОЕдиновременнойВыплатеПДС
			|ГДЕ
			|	пдс_РешениеОЕдиновременнойВыплатеПДС.Ссылка.Дата >= &ДатаНач
			|	И пдс_РешениеОЕдиновременнойВыплатеПДС.Ссылка.Организация = &Организация
			|	И пдс_РешениеОЕдиновременнойВыплатеПДС.Ссылка.Дата <= &ДатаКон
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ВключатьПДС
			|			ТОГДА пдс_РешениеОВыплатеВыкупнойСуммы.Участник
			|		ИНАЧЕ NULL
			|	КОНЕЦ
			|ИЗ
			|	Документ.пдс_РешениеОВыплатеВыкупнойСуммы КАК пдс_РешениеОВыплатеВыкупнойСуммы
			|ГДЕ
			|	пдс_РешениеОВыплатеВыкупнойСуммы.Ссылка.Дата >= &ДатаНач
			|	И пдс_РешениеОВыплатеВыкупнойСуммы.Ссылка.Организация = &Организация
			|	И пдс_РешениеОВыплатеВыкупнойСуммы.Ссылка.Дата <= &ДатаКон";	   
			
			Запрос.УстановитьПараметр("Организация", Объект.Организация);
			Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.ДатаДокументовНачисления));
			Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.ДатаДокументовНачисления));
			Если НЕ ЗначениеЗаполнено(Объект.Модуль) Тогда
				Запрос.УстановитьПараметр("ВключатьПР", Истина);
				Запрос.УстановитьПараметр("ВключатьОПС", Истина); 
				Запрос.УстановитьПараметр("ВключатьПДС", Истина); 
			Иначе
				Запрос.УстановитьПараметр("ВключатьПР", Объект.Модуль = Перечисления.уп_ВидыДеятельности.ПР);
				Запрос.УстановитьПараметр("ВключатьОПС", Объект.Модуль = Перечисления.уп_ВидыДеятельности.ОПС); 
				Запрос.УстановитьПараметр("ВключатьПДС", Объект.Модуль = Перечисления.уп_ВидыДеятельности.ПДС); 
			КонецЕсли;	

			СписокУчастников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Участник");
			
		КонецЕсли;
	КонецЕсли;
	#Вставка
	// ХМНПФ+ 29.11.2021 ХлопцевБА // добавлен отбор "Участник" // №3386
	Если НЕ Участник.Пустая() Тогда
		Если СписокУчастников <> Неопределено Тогда
		  СписокУчастников.Очистить();
		  СписокУчастников.Добавить(Участник);
		КонецЕсли;
	КонецЕсли;	
	// ХМНПФ+ 29.11.2021 ХлопцевБА // добавлен отбор "Участник" // №3386
	#КонецВставки
	
	Если ВключатьТолькоПСДокументов Тогда
		//Составитм список участников и пенсионных счетов 
		Если ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
			ТекстУсловия =  " И уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
		Иначе
			ТекстУсловия = "";
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета КАК ПС,
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.Участник КАК Участник,
		|	СУММА(уп_НДФЛСведенияОДоходахУчастниковОбороты.СуммаДоходаОборот) КАК НБ,
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.Участник.Родитель КАК ГруппаУчастников,
		|	ВЫБОР
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_НачислениеПенсий
		|			ТОГДА &ВыплатаПенсии
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_ЗакрытиеСчетов
		|				И уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета.Участник <> уп_НДФЛСведенияОДоходахУчастниковОбороты.Участник
		|			ТОГДА &ВыплатаНаследникам
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_ЗакрытиеСчетов
		|				И уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета.Участник = уп_НДФЛСведенияОДоходахУчастниковОбороты.Участник
		|               И уп_НДФЛСведенияОДоходахУчастниковОбороты.КодДохода = &КодДоходаРасторжение
		|			ТОГДА &ВыплатаРасторженцам
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_ЗакрытиеСчетов
		|				И уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета.Участник = уп_НДФЛСведенияОДоходахУчастниковОбороты.Участник
		|               И уп_НДФЛСведенияОДоходахУчастниковОбороты.КодДохода = &КодДоходаРасторжениеВзносыФЛ
		|			ТОГДА &ВыплатаРасторженцамВзносыФЛ 
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_ЗакрытиеСчетов
		|				И уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета.Участник = уп_НДФЛСведенияОДоходахУчастниковОбороты.Участник
		|			ТОГДА &ВыплатаРасторженцам
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_ДополнительнаяВыплатаПравопреемникам
		|			ТОГДА &ВыплатаНаследникам
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_НачислениеНаследнику
		|			ТОГДА &ВыплатаНаследникам
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_НачислениеОстатковПоРасторгнутымДоговорамНПО
		|			ТОГДА &ВыплатаРасторженцам
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений
		|			ТОГДА &РасторжениеОПС
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_ЗакрытиеДоговораВПользуТретьихЛиц
		|			ТОГДА &ВыплатаРасторженцам
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.пдс_НачислениеПенсийПДС
		|			ТОГДА &ВыплатаПенсииПДС 
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.пдс_РешениеОЕдиновременнойВыплатеПДС
		|			ТОГДА &ЕВПДС 
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.пдс_РешениеОВыплатеПравопреемникамПДС
		|			ТОГДА &ВыплатаНаследникамПДС 
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.пдс_РешениеОВыплатеВыкупнойСуммы
		|           И уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор.ТипРешения = ЗНАЧЕНИЕ(Перечисление.пдс_ТипыЗаявленияНаВыкупнуюСумму.ВЧастиСобственныхСредств)
		|           И уп_НДФЛСведенияОДоходахУчастниковОбороты.КодДохода = &КодДоходаРасторжениеПДС
		|			ТОГДА &ВыкупнаяСуммаПДС 
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.пдс_РешениеОВыплатеВыкупнойСуммы
		|           И уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор.ТипРешения = ЗНАЧЕНИЕ(Перечисление.пдс_ТипыЗаявленияНаВыкупнуюСумму.ВЧастиСобственныхСредств)
		|           И уп_НДФЛСведенияОДоходахУчастниковОбороты.КодДохода = &КодДоходаРасторжениеПДСВзносыФЛ
		|			ТОГДА &ВыкупнаяСуммаПДСВзносыФЛ 
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.пдс_РешениеОВыплатеВыкупнойСуммы
		|           И уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор.ТипРешения = ЗНАЧЕНИЕ(Перечисление.пдс_ТипыЗаявленияНаВыкупнуюСумму.ПоОсобымОбстоятельствам)
		|			ТОГДА &ОсобыеОбстоятельстваПДС
		|		ИНАЧЕ &ПустойВидНачисления
		|	КОНЕЦ КАК ВидНачисления,
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор.ПодразделениеОрганизации КАК РегистраторПодразделениеОрганизации
		|ИЗ
		|	РегистрНакопления.уп_НДФЛСведенияОДоходахУчастников.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК уп_НДФЛСведенияОДоходахУчастниковОбороты 
		|ГДЕ
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор В(&СписокРегистраторов)"+ТекстУсловия+"
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета,
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.Участник,
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.Участник.Родитель,
		|	ВЫБОР
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_НачислениеПенсий
		|			ТОГДА &ВыплатаПенсии
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_ЗакрытиеСчетов
		|				И уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета.Участник <> уп_НДФЛСведенияОДоходахУчастниковОбороты.Участник
		|			ТОГДА &ВыплатаНаследникам  
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_ЗакрытиеСчетов
		|				И уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета.Участник = уп_НДФЛСведенияОДоходахУчастниковОбороты.Участник
		|               И уп_НДФЛСведенияОДоходахУчастниковОбороты.КодДохода = &КодДоходаРасторжение
		|			ТОГДА &ВыплатаРасторженцам
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_ЗакрытиеСчетов
		|				И уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета.Участник = уп_НДФЛСведенияОДоходахУчастниковОбороты.Участник
		|               И уп_НДФЛСведенияОДоходахУчастниковОбороты.КодДохода = &КодДоходаРасторжениеВзносыФЛ
		|			ТОГДА &ВыплатаРасторженцамВзносыФЛ 
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_ЗакрытиеСчетов
		|				И уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета.Участник = уп_НДФЛСведенияОДоходахУчастниковОбороты.Участник
		|			ТОГДА &ВыплатаРасторженцам
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_ДополнительнаяВыплатаПравопреемникам
		|			ТОГДА &ВыплатаНаследникам
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_НачислениеНаследнику
		|			ТОГДА &ВыплатаНаследникам
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_НачислениеОстатковПоРасторгнутымДоговорамНПО
		|			ТОГДА &ВыплатаРасторженцам
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений
		|			ТОГДА &РасторжениеОПС
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.уп_ЗакрытиеДоговораВПользуТретьихЛиц
		|			ТОГДА &ВыплатаРасторженцам 
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.пдс_НачислениеПенсийПДС
		|			ТОГДА &ВыплатаПенсииПДС  
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.пдс_РешениеОЕдиновременнойВыплатеПДС
		|			ТОГДА &ЕВПДС  
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.пдс_РешениеОВыплатеПравопреемникамПДС
		|			ТОГДА &ВыплатаНаследникамПДС 
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.пдс_РешениеОВыплатеВыкупнойСуммы
		|           И уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор.ТипРешения = ЗНАЧЕНИЕ(Перечисление.пдс_ТипыЗаявленияНаВыкупнуюСумму.ВЧастиСобственныхСредств)
		|           И уп_НДФЛСведенияОДоходахУчастниковОбороты.КодДохода = &КодДоходаРасторжениеПДС
		|			ТОГДА &ВыкупнаяСуммаПДС 
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.пдс_РешениеОВыплатеВыкупнойСуммы
		|           И уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор.ТипРешения = ЗНАЧЕНИЕ(Перечисление.пдс_ТипыЗаявленияНаВыкупнуюСумму.ВЧастиСобственныхСредств)
		|           И уп_НДФЛСведенияОДоходахУчастниковОбороты.КодДохода = &КодДоходаРасторжениеПДСВзносыФЛ
		|			ТОГДА &ВыкупнаяСуммаПДСВзносыФЛ 
		|		КОГДА уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор ССЫЛКА Документ.пдс_РешениеОВыплатеВыкупнойСуммы
		|           И уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор.ТипРешения = ЗНАЧЕНИЕ(Перечисление.пдс_ТипыЗаявленияНаВыкупнуюСумму.ПоОсобымОбстоятельствам)
		|			ТОГДА &ОсобыеОбстоятельстваПДС
		|		ИНАЧЕ &ПустойВидНачисления
		|	КОНЕЦ,
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.Регистратор.ПодразделениеОрганизации";
		
		Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.ДатаФормированияДокументов));
		Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.ДатаФормированияДокументов));
		Запрос.УстановитьПараметр("СписокРегистраторов", СписокРегистраторов);
		Запрос.УстановитьПараметр("ВыплатаПенсии", ПланыВидовРасчета.Начисления.уп_Пенсия);
		КодДоходаРасторжение = ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцам.КодДоходаНДФЛ;
		КодДоходаРасторжениеВзносыФЛ = ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцамВзносыФЛ.КодДоходаНДФЛ;
		Запрос.УстановитьПараметр("КодДоходаРасторжение", КодДоходаРасторжение); 
		Запрос.УстановитьПараметр("КодДоходаРасторжениеВзносыФЛ", КодДоходаРасторжениеВзносыФЛ); 
		Запрос.УстановитьПараметр("ВыплатаРасторженцам", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцам);
		Если ЗначениеЗаполнено(ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцамВзносыФЛ.КодДоходаНДФЛ) Тогда
			Запрос.УстановитьПараметр("ВыплатаРасторженцамВзносыФЛ", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцамВзносыФЛ);
		Иначе  
			Запрос.УстановитьПараметр("ВыплатаРасторженцамВзносыФЛ", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцам);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВыплатаНаследникам", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаНаследникам);
		Запрос.УстановитьПараметр("РасторжениеОПС", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаПравопреемникамОПС); 
		Запрос.УстановитьПараметр("ВыплатаПенсииПДС", ПланыВидовРасчета.Начисления.пдс_Пенсия); 
		Запрос.УстановитьПараметр("ВыплатаНаследникамПДС", ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаПравопреемникам);
		Запрос.УстановитьПараметр("ЕВПДС", ПланыВидовРасчета.Начисления.пдс_ЕВ);  
		КодДоходаРасторжениеПДС = ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцам.КодДоходаНДФЛ;
		КодДоходаРасторжениеПДСВзносыФЛ = ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцамВзносыФЛ.КодДоходаНДФЛ;  
		Запрос.УстановитьПараметр("КодДоходаРасторжениеПДС", КодДоходаРасторжениеПДС); 
		Запрос.УстановитьПараметр("КодДоходаРасторжениеПДСВзносыФЛ", КодДоходаРасторжениеПДСВзносыФЛ); 
		Запрос.УстановитьПараметр("ВыкупнаяСуммаПДС", ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцам);
		Если ЗначениеЗаполнено(ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцамВзносыФЛ.КодДоходаНДФЛ) Тогда
			Запрос.УстановитьПараметр("ВыкупнаяСуммаПДСВзносыФЛ", ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцамВзносыФЛ);
		Иначе  
			Запрос.УстановитьПараметр("ВыкупнаяСуммаПДСВзносыФЛ", ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцам);
		КонецЕсли;
		Запрос.УстановитьПараметр("ОсобыеОбстоятельстваПДС", ПланыВидовРасчета.Начисления.пдс_ВыплатыПоОсобымОбстоятельствам); 
		Запрос.УстановитьПараметр("ПустойВидНачисления", ПланыВидовРасчета.Начисления.ПустаяСсылка());  
		Запрос.УстановитьПараметр("Подразделение", Объект.ОтборПодразделение);
			
		#Вставка
				//+ХМНПФ 26.03.2021  Хлопцев Б.А. //  № 3086 База для распределения НДФЛ без учета остатков
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//|	НачисленияПенсийОстатки.НомерСчета КАК ПС,
		//|	НачисленияПенсийОстатки.НомерСчета.Участник КАК Участник,
		//|	НачисленияПенсийОстатки.НомерСчета.Участник.Родитель КАК ГруппаУчастников,
		//|	НачисленияПенсийОстатки.НалоговаяБазаПоНДФЛОстаток КАК НБ,
		//|	&ВыплатаПенсии КАК ВидНачисления
		//|ИЗ
		//|	РегистрНакопления.уп_НачисленияПенсий.Остатки(
		//|		&ДатаДок,
		//|		НомерСчета.Владелец.Организация = &Организация "+ ?(Переключатель1 = 0," И НомерСчета.Участник В (&СписокУчастников)", " " )+"
		//|			) КАК НачисленияПенсийОстатки
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ПрочиеНачисленияОстатки.НомерСчета,
		//|	ПрочиеНачисленияОстатки.Участник,
		//|	ПрочиеНачисленияОстатки.Участник.Родитель,
		//|	ПрочиеНачисленияОстатки.НалоговаяБазаПоНДФЛОстаток,
		//|	ВЫБОР
		//|		КОГДА ПрочиеНачисленияОстатки.ТипВыплаты = &Расторженцам
		//|			ТОГДА &ВыплатаРасторженцам
		//|		ИНАЧЕ &ВыплатаНаследникам
		//|	КОНЕЦ КАК ВидНачисления
		//|ИЗ
		//|	РегистрНакопления.уп_ПрочиеНачисления.Остатки(
		//|		&ДатаДок,
		//|		Организация = &Организация
		//|		    И ТипВыплаты В (&СписокТиповВыплат) "+ ?(Переключатель1 = 0," И Участник В (&СписокУчастников)", " " )+"
		//|		    ) КАК ПрочиеНачисленияОстатки
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НомерСчета";
			
		#КонецВставки
	ИначеЕсли Объект.Модуль = Перечисления.уп_ВидыДеятельности.ПР Тогда	
		Если ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
			ТекстУсловияНП =  " ГДЕ НачисленияПенсийОстатки.НомерСчета.Владелец.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)";
			ТекстУсловияПН =  " ГДЕ ПрочиеНачисленияОстатки.НомерСчета.Владелец.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)";
			
		Иначе
			ТекстУсловияНП = "";
			ТекстУсловияПН = "";
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		#Удаление
		|	НачисленияПенсийОстатки.НомерСчета КАК ПС,
		|	НачисленияПенсийОстатки.НомерСчета.Участник КАК Участник,
		|	НачисленияПенсийОстатки.НомерСчета.Участник.Родитель КАК ГруппаУчастников,
		|	НачисленияПенсийОстатки.НалоговаяБазаПоНДФЛОстаток КАК НБ,
		|	&ВыплатаПенсии КАК ВидНачисления
		|ИЗ
		|	РегистрНакопления.уп_НачисленияПенсий.Остатки(
		|		&ДатаДок,
		|		НомерСчета.Владелец.Организация = &Организация "+ ?(Переключатель1 = 0," И НомерСчета.Участник В (&СписокУчастников)", " " )+"
		|			) КАК НачисленияПенсийОстатки "+ТекстУсловияНП+"
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрочиеНачисленияОстатки.НомерСчета,
		|	ПрочиеНачисленияОстатки.Участник,
		|	ПрочиеНачисленияОстатки.Участник.Родитель,
		|	ПрочиеНачисленияОстатки.НалоговаяБазаПоНДФЛОстаток,
		|	ВЫБОР
		|		КОГДА ПрочиеНачисленияОстатки.ТипВыплаты = &Расторженцам И  ПрочиеНачисленияОстатки.ТипСуммы<>&ВзносыФЛ
		|			ТОГДА &ВыплатаРасторженцам 
		|		КОГДА ПрочиеНачисленияОстатки.ТипВыплаты = &Расторженцам И  ПрочиеНачисленияОстатки.ТипСуммы=&ВзносыФЛ
		|			ТОГДА &ВыплатаРасторженцамВзносыФЛ 
		|		ИНАЧЕ &ВыплатаНаследникам
		|	КОНЕЦ КАК ВидНачисления
		|ИЗ
		|	РегистрНакопления.уп_ПрочиеНачисления.Остатки(
		|		&ДатаДок,
		|		Организация = &Организация
		|		    И ТипВыплаты В (&СписокТиповВыплат) "+ ?(Переключатель1 = 0," И Участник В (&СписокУчастников)", " " )+"
		|		    ) КАК ПрочиеНачисленияОстатки  "+ТекстУсловияПН+"
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСчета";
		#КонецУдаления
		#Вставка
		// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета.Владелец КАК ПСВладелец,
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета.Участник.уп_ФизЛицо КАК Участникуп_ФизЛицо,
	// -ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета КАК ПС,
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета.Участник КАК Участник,
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета.Участник.Родитель КАК ГруппаУчастников,
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.СуммаДоходаОборот КАК НБ,
		|	&ВыплатаПенсии КАК ВидНачисления
		|ИЗ
		|	РегистрНакопления.уп_НДФЛСведенияОДоходахУчастников.Обороты(
		|			&НачПериода,
		|			&ДатаДок,
		|			Период,
		|		НомерСчета.Владелец.Организация = &Организация "+ ?(Переключатель1 = 0," И НомерСчета.Участник В (&СписокУчастников)", " " )+"
		|		    ) КАК уп_НДФЛСведенияОДоходахУчастниковОбороты  "+ТекстУсловияПН+"
		|
		|УПОРЯДОЧИТЬ ПО
	// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.Участник";
//--		|	уп_НДФЛСведенияОДоходахУчастниковОбороты.НомерСчета";

		
	// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
		хм_Ускорение = Новый Структура();
		#КонецВставки
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("СписокУчастников", СписокУчастников);
		#Удаление
		Запрос.УстановитьПараметр("ДатаДок", Новый Граница(КонецДня(Объект.ДатаФормированияДокументов),ВидГраницы.Включая));
		#КонецУдаления
		#Вставка
		Запрос.УстановитьПараметр("ДатаДок", Новый Граница(КонецМесяца(Объект.ДатаДокументовНачисления),ВидГраницы.Включая));
		Запрос.УстановитьПараметр("НачПериода", Новый Граница(НачалоМесяца(Объект.НалоговыйПериод),ВидГраницы.Включая));
		//- ХМНПФ 26.03.2021  Хлопцев Б.А. //  № 3086
		#КонецВставки
		Запрос.УстановитьПараметр("ВыплатаПенсии", ПланыВидовРасчета.Начисления.уп_Пенсия);
		Запрос.УстановитьПараметр("Расторженцам", Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам);  
		Запрос.УстановитьПараметр("ВзносыФЛ", Справочники.уп_ТипыСумм.ВзносыФиз);  
		Запрос.УстановитьПараметр("ВыплатаРасторженцам", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцам);
		Если ЗначениеЗаполнено(ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцамВзносыФЛ.КодДоходаНДФЛ) Тогда
			Запрос.УстановитьПараметр("ВыплатаРасторженцамВзносыФЛ", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцамВзносыФЛ); 
		Иначе
			Запрос.УстановитьПараметр("ВыплатаРасторженцамВзносыФЛ", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцам); 
		КонецЕсли;	
		Запрос.УстановитьПараметр("ВыплатаНаследникам", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаНаследникам);
		СписокТиповВыплат = Новый СписокЗначений;
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВыплатыНаследникам);
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам);
		Запрос.УстановитьПараметр("СписокТиповВыплат", СписокТиповВыплат);  
		Запрос.УстановитьПараметр("Подразделение", Объект.ОтборПодразделение); 
		
	ИначеЕсли Объект.Модуль = Перечисления.уп_ВидыДеятельности.ПДС Тогда	
		Если ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
			ТекстУсловияНП =  " ГДЕ НачисленияПенсийОстатки.НомерСчета.Владелец.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)";
			ТекстУсловияПН =  " ГДЕ ПрочиеНачисленияОстатки.НомерСчета.Владелец.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)";
		Иначе
			ТекстУсловияНП = "";
			ТекстУсловияПН = "";
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	НачисленияПенсийОстатки.НомерСчета КАК ПС,
		|	НачисленияПенсийОстатки.НомерСчета.Участник КАК Участник,
		|	НачисленияПенсийОстатки.НомерСчета.Участник.Родитель КАК ГруппаУчастников,
		|	НачисленияПенсийОстатки.НалоговаяБазаПоНДФЛОстаток КАК НБ,
		|	&ВыплатаПенсии КАК ВидНачисления
		|ИЗ
		|	РегистрНакопления.пдс_НачисленияПенсийПДС.Остатки(
		|		&ДатаДок,
		|		НомерСчета.Владелец.Организация = &Организация "+ ?(Переключатель1 = 0," И НомерСчета.Участник В (&СписокУчастников)", " " )+"
		|			) КАК НачисленияПенсийОстатки "+ТекстУсловияНП+"
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрочиеНачисленияОстатки.НомерСчета,
		|	ПрочиеНачисленияОстатки.Участник,
		|	ПрочиеНачисленияОстатки.Участник.Родитель,
		|	ПрочиеНачисленияОстатки.НалоговаяБазаПоНДФЛОстаток,
		|	ВЫБОР
		|		КОГДА ПрочиеНачисленияОстатки.ТипВыплаты = &Расторженцам И  ПрочиеНачисленияОстатки.ТипСуммы<>&ВзносыФЛ
		|			ТОГДА &ВыплатаРасторженцам
		|		КОГДА ПрочиеНачисленияОстатки.ТипВыплаты = &Расторженцам И  ПрочиеНачисленияОстатки.ТипСуммы=&ВзносыФЛ
		|			ТОГДА &ВыплатаРасторженцамВзносыФЛ
		|		КОГДА ПрочиеНачисленияОстатки.ТипВыплаты = &ОсобыеОбстоятельства
		|			ТОГДА &ВыплатаРасторженцамОО 
		|		КОГДА ПрочиеНачисленияОстатки.ТипВыплаты = &ЕВ_ПДС
		|			ТОГДА &ВыплатаЕВ 
		|		ИНАЧЕ &ВыплатаНаследникам
		|	КОНЕЦ КАК ВидНачисления
		|ИЗ
		|	РегистрНакопления.пдс_ПрочиеНачисленияПДС.Остатки(
		|		&ДатаДок,
		|		Организация = &Организация
		|		    И ТипВыплаты В (&СписокТиповВыплат) "+ ?(Переключатель1 = 0," И Участник В (&СписокУчастников)", " " )+"
		|		    ) КАК ПрочиеНачисленияОстатки  "+ТекстУсловияПН+"
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСчета";
		
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("СписокУчастников", СписокУчастников);
		Запрос.УстановитьПараметр("ДатаДок", Новый Граница(КонецДня(Объект.ДатаФормированияДокументов),ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ВыплатаПенсии", ПланыВидовРасчета.Начисления.пдс_Пенсия); 
		Запрос.УстановитьПараметр("Расторженцам", Перечисления.уп_ТипыВыплат.ВыкупнаяСуммаПДС); 
		Запрос.УстановитьПараметр("ОсобыеОбстоятельства", Перечисления.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС);
		Запрос.УстановитьПараметр("ЕВ_ПДС", Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС);
		Запрос.УстановитьПараметр("ВзносыФЛ", Справочники.пдс_ТипыСуммПДС.Сберегательный);  
		Запрос.УстановитьПараметр("ВыплатаРасторженцам", ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцам);
		Если ЗначениеЗаполнено(ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцамВзносыФЛ.КодДоходаНДФЛ) Тогда
			Запрос.УстановитьПараметр("ВыплатаРасторженцамВзносыФЛ", ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцамВзносыФЛ); 
		Иначе
			Запрос.УстановитьПараметр("ВыплатаРасторженцамВзносыФЛ", ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцам); 
		КонецЕсли;	
		Запрос.УстановитьПараметр("ВыплатаНаследникам", ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаПравопреемникам);
		Запрос.УстановитьПараметр("ВыплатаРасторженцамОО", ПланыВидовРасчета.Начисления.пдс_ВыплатыПоОсобымОбстоятельствам);
		Запрос.УстановитьПараметр("ВыплатаЕВ", ПланыВидовРасчета.Начисления.пдс_ЕВ); 
		СписокТиповВыплат = Новый СписокЗначений;
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВыплатыПравопреемникамПДС);
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВыкупнаяСуммаПДС);   
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС);   
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС); 
		Запрос.УстановитьПараметр("СписокТиповВыплат", СписокТиповВыплат);  
		Запрос.УстановитьПараметр("Подразделение", Объект.ОтборПодразделение); 
		
	ИначеЕсли Объект.Модуль = Перечисления.уп_ВидыДеятельности.ОПС Тогда  
		Если ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
			ТекстУсловия =  " ГДЕ ПрочиеНачисленияОПСОстатки.ДоговорОПС.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)";
		Иначе
			ТекстУсловия = "";
		КонецЕсли;	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПрочиеНачисленияОПСОстатки.Участник КАК Участник,
		|	ПрочиеНачисленияОПСОстатки.ДоговорОПС КАК ПС,
		|	ПрочиеНачисленияОПСОстатки.Участник.Родитель КАК ГруппаУчастников,
		|	ПрочиеНачисленияОПСОстатки.НалоговаяБазаПоНДФЛОстаток КАК НБ,
		|	&ВыплатаПравопреемникамОПС КАК ВидНачисления
		|ИЗ
		|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Остатки(
		|			&ДатаДок,
		|			Организация = &Организация
		|				И ТипВыплаты В (&СписокТиповВыплат) "+ ?(Переключатель1 = 0," И Участник В (&СписокУчастников)", " " )+"
		|				) КАК ПрочиеНачисленияОПСОстатки "+ТекстУсловия+"
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПС";
		
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("СписокУчастников", СписокУчастников);
		Запрос.УстановитьПараметр("ДатаДок", Новый Граница(КонецДня(Объект.ДатаФормированияДокументов),ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ВыплатаПравопреемникамОПС", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаПравопреемникамОПС);
		СписокТиповВыплат = Новый СписокЗначений;
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС);
		Запрос.УстановитьПараметр("СписокТиповВыплат", СписокТиповВыплат);
		Запрос.УстановитьПараметр("Подразделение", Объект.ОтборПодразделение);
			
	Иначе
		Если ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
			ТекстУсловияНП =  " ГДЕ НачисленияПенсийОстатки.НомерСчета.Владелец.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)";
			ТекстУсловияПН =  " ГДЕ ПрочиеНачисленияОстатки.НомерСчета.Владелец.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)"; 
			ТекстУсловияНП_ПДС =  " ГДЕ пдс_НачисленияПенсийПДСОстатки.НомерСчета.Владелец.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)";
			ТекстУсловияПН_ПДС =  " ГДЕ пдс_ПрочиеНачисленияПДСОстатки.НомерСчета.Владелец.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)"; 
			ТекстУсловияПНО =  " ГДЕ ПрочиеНачисленияОПСОстатки.ДоговорОПС.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)";  
		Иначе
			ТекстУсловияНП = "";
			ТекстУсловияПН = ""; 
			ТекстУсловияНП_ПДС = "";
			ТекстУсловияПН_ПДС = ""; 
			ТекстУсловияПНО = "";
		КонецЕсли;   
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	НачисленияПенсийОстатки.НомерСчета КАК ПС,
		|	НачисленияПенсийОстатки.НомерСчета.Участник КАК Участник,
		|	НачисленияПенсийОстатки.НомерСчета.Участник.Родитель КАК ГруппаУчастников,
		|	НачисленияПенсийОстатки.НалоговаяБазаПоНДФЛОстаток КАК НБ,
		|	&ВыплатаПенсии КАК ВидНачисления
		|ИЗ
		|	РегистрНакопления.уп_НачисленияПенсий.Остатки(
		|		&ДатаДок,
		|		НомерСчета.Владелец.Организация = &Организация "+ ?(Переключатель1 = 0," И НомерСчета.Участник В (&СписокУчастников)", " " )+"
		|			) КАК НачисленияПенсийОстатки "+ТекстУсловияНП+"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	пдс_НачисленияПенсийПДСОстатки.НомерСчета КАК ПС,
		|	пдс_НачисленияПенсийПДСОстатки.НомерСчета.Участник КАК Участник,
		|	пдс_НачисленияПенсийПДСОстатки.НомерСчета.Участник.Родитель КАК ГруппаУчастников,
		|	пдс_НачисленияПенсийПДСОстатки.НалоговаяБазаПоНДФЛОстаток КАК НБ,
		|	&ВыплатаПенсииПДС КАК ВидНачисления
		|ИЗ
		|	РегистрНакопления.пдс_НачисленияПенсийПДС.Остатки(
		|		&ДатаДок,
		|		НомерСчета.Владелец.Организация = &Организация "+ ?(Переключатель1 = 0," И НомерСчета.Участник В (&СписокУчастников)", " " )+"
		|			) КАК пдс_НачисленияПенсийПДСОстатки "+ТекстУсловияНП+"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрочиеНачисленияОПСОстатки.ДоговорОПС КАК ПС,
		|	ПрочиеНачисленияОПСОстатки.Участник КАК Участник,
		|	ПрочиеНачисленияОПСОстатки.Участник.Родитель КАК ГруппаУчастников,
		|	ПрочиеНачисленияОПСОстатки.НалоговаяБазаПоНДФЛОстаток КАК НБ,
		|	&ВыплатаПравопреемникамОПС КАК ВидНачисления
		|ИЗ
		|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Остатки(
		|			&ДатаДок,
		|			Организация = &Организация
		|				И ТипВыплаты В (&СписокТиповВыплат) "+ ?(Переключатель1 = 0," И Участник В (&СписокУчастников)", " " )+"
		|				) КАК ПрочиеНачисленияОПСОстатки "+ТекстУсловияПНО+"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрочиеНачисленияОстатки.НомерСчета,
		|	ПрочиеНачисленияОстатки.Участник,
		|	ПрочиеНачисленияОстатки.Участник.Родитель,
		|	ПрочиеНачисленияОстатки.НалоговаяБазаПоНДФЛОстаток,
		|	ВЫБОР
		|		КОГДА ПрочиеНачисленияОстатки.ТипВыплаты = &Расторженцам И  ПрочиеНачисленияОстатки.ТипСуммы<>&ВзносыФЛ
		|			ТОГДА &ВыплатаРасторженцам 
		|		КОГДА ПрочиеНачисленияОстатки.ТипВыплаты = &Расторженцам И  ПрочиеНачисленияОстатки.ТипСуммы=&ВзносыФЛ
		|			ТОГДА &ВыплатаРасторженцамВзносыФЛ 
		|		ИНАЧЕ &ВыплатаНаследникам
		|	КОНЕЦ КАК ВидНачисления
		|ИЗ
		|	РегистрНакопления.уп_ПрочиеНачисления.Остатки(
		|		&ДатаДок,
		|		Организация = &Организация
		|		    И ТипВыплаты В (&СписокТиповВыплат) "+ ?(Переключатель1 = 0," И Участник В (&СписокУчастников)", " " )+"
		|		    ) КАК ПрочиеНачисленияОстатки "+ТекстУсловияПН+"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	пдс_ПрочиеНачисленияПДСОстатки.НомерСчета,
		|	пдс_ПрочиеНачисленияПДСОстатки.Участник,
		|	пдс_ПрочиеНачисленияПДСОстатки.Участник.Родитель,
		|	пдс_ПрочиеНачисленияПДСОстатки.НалоговаяБазаПоНДФЛОстаток,
		|	ВЫБОР
		|		КОГДА пдс_ПрочиеНачисленияПДСОстатки.ТипВыплаты = &РасторженцамПДС И  пдс_ПрочиеНачисленияПДСОстатки.ТипСуммы<>&ВзносыФЛПДС
		|			ТОГДА &ВыплатаРасторженцамПДС     
		|		КОГДА пдс_ПрочиеНачисленияПДСОстатки.ТипВыплаты = &РасторженцамПДС И  пдс_ПрочиеНачисленияПДСОстатки.ТипСуммы=&ВзносыФЛПДС
		|			ТОГДА &ВыплатаРасторженцамПДСВзносыФЛ     
		|		КОГДА ПрочиеНачисленияОстатки.ТипВыплаты = &ОсобыеОбстоятельства
		|			ТОГДА &ВыплатаРасторженцамОО 
		|		КОГДА пдс_ПрочиеНачисленияПДСОстатки.ТипВыплаты = &ЕВ_ПДС
		|			ТОГДА &ВыплатаЕВ 
		|		ИНАЧЕ &ВыплатаНаследникамПДС
		|	КОНЕЦ КАК ВидНачисления
		|ИЗ
		|	РегистрНакопления.пдс_ПрочиеНачисленияПДС.Остатки(
		|		&ДатаДок,
		|		Организация = &Организация
		|		    И ТипВыплаты В (&СписокТиповВыплат) "+ ?(Переключатель1 = 0," И Участник В (&СписокУчастников)", " " )+"
		|		    ) КАК пдс_ПрочиеНачисленияПДСОстатки "+ТекстУсловияПН+"
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСчета";
		
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("СписокУчастников", СписокУчастников);
		Запрос.УстановитьПараметр("ДатаДок", КонецДня(Объект.ДатаФормированияДокументов));
		Запрос.УстановитьПараметр("ВыплатаПенсии", ПланыВидовРасчета.Начисления.уп_Пенсия);  
		Запрос.УстановитьПараметр("ВыплатаПенсииПДС", ПланыВидовРасчета.Начисления.пдс_Пенсия);
		Запрос.УстановитьПараметр("Расторженцам", Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам);
		Запрос.УстановитьПараметр("ОсобыеОбстоятельства", Перечисления.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС);
		Запрос.УстановитьПараметр("ВзносыФЛ", Справочники.уп_ТипыСумм.ВзносыФиз); 
		Запрос.УстановитьПараметр("ВзносыФЛПДС", Справочники.пдс_ТипыСуммПДС.Сберегательный); 
		Запрос.УстановитьПараметр("ВыплатаРасторженцам", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцам);
		Если ЗначениеЗаполнено(ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцамВзносыФЛ.КодДоходаНДФЛ) Тогда
			Запрос.УстановитьПараметр("ВыплатаРасторженцамВзносыФЛ", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцамВзносыФЛ);
		Иначе 
			Запрос.УстановитьПараметр("ВыплатаРасторженцамВзносыФЛ", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцам);
		КонецЕсли;	
		Запрос.УстановитьПараметр("ВыплатаНаследникам", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаНаследникам);
		Запрос.УстановитьПараметр("ВыплатаПравопреемникамОПС", ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаПравопреемникамОПС); 
		Запрос.УстановитьПараметр("ВыплатаРасторженцамПДС", ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцам);
		Если ЗначениеЗаполнено(ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцамВзносыФЛ.КодДоходаНДФЛ) Тогда
			Запрос.УстановитьПараметр("ВыплатаРасторженцамПДСВзносыФЛ", ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцамВзносыФЛ);
		Иначе 
			Запрос.УстановитьПараметр("ВыплатаРасторженцамПДСВзносыФЛ", ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаРасторженцам);
		КонецЕсли;	
		Запрос.УстановитьПараметр("ВыплатаРасторженцамОО", ПланыВидовРасчета.Начисления.пдс_ВыплатыПоОсобымОбстоятельствам);
		Запрос.УстановитьПараметр("ВыплатаНаследникамПДС", ПланыВидовРасчета.Начисления.пдс_ВыкупнаяСуммаПравопреемникам);
		Запрос.УстановитьПараметр("ВыплатаЕВ", ПланыВидовРасчета.Начисления.пдс_ЕВ); 
		Запрос.УстановитьПараметр("РасторженцамПДС", Перечисления.уп_ТипыВыплат.ВыкупнаяСуммаПДС);
		Запрос.УстановитьПараметр("ЕВ_ПДС", Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС);
		
		СписокТиповВыплат = Новый СписокЗначений;
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВыплатыНаследникам);
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам);
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС); 
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВыплатыПравопреемникамПДС);
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВыкупнаяСуммаПДС); 
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС); 
		СписокТиповВыплат.Добавить(Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС); 
		Запрос.УстановитьПараметр("СписокТиповВыплат", СписокТиповВыплат);
		Запрос.УстановитьПараметр("Подразделение", Объект.ОтборПодразделение);
			
	КонецЕсли;
	
	ТЗДокумента = Запрос.Выполнить().Выгрузить();
	ТЗ = ТЗДокумента.Скопировать();
	
	//сортировка по признакам
	#Вставка
	// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
	Если хм_Ускорение = Неопределено Тогда
		ТЗ.Индексы.Добавить("Участник");
	#КонецВставки
		
		ПризнакиСортировки = "Участник";
		ТЗ.Сортировать(ПризнакиСортировки);
	#Вставка
	Иначе		
	//Сортировка выполнена в заросе	
	КонецЕсли;
	#КонецВставки

	
	ТУчастник = "";
	НачислениеНДФЛ = "";
	СчетчикСтрокВДокументе = 0;
	Для Н=0 По ТЗ.Количество()-1 Цикл
		ТекСтрока = ТЗ.Получить(Н);
		СоответствуетДокументу = Истина;
		
		Если Объект.ПоПачкам И СчетчикСтрокВДокументе >= Объект.КоличествоВПачке
			И ТУчастник <> ТекСтрока.Участник Тогда
			СоответствуетДокументу = Ложь;
		КонецЕсли;
		Если ТУчастник <> ТекСтрока.Участник Тогда
			ТУчастник = ТекСтрока.Участник;
		КонецЕсли;	
		
		Если Н = 0 Или Не СоответствуетДокументу Тогда
			Если Н>0 Тогда
				НачислениеНДФЛ.Записать();
				//надо еще рассчитать его
				//НачислениеНДФЛ.РассчитатьНДФЛ();
				уп_РасчетНДФЛ.ЗаполнитьДокументНачисленияНДФЛ(НачислениеНДФЛ);
				НачислениеНДФЛ.Записать();
				НовоеНачисление = Объект.НовыеНачисления.Добавить();
				НовоеНачисление.Документ = НачислениеНДФЛ.Ссылка;
			КонецЕсли;
			
			НачислениеНДФЛ = Документы.уп_НачислениеНДФЛ.СоздатьДокумент();
			НачислениеНДФЛ.Организация = Объект.Организация;
			НачислениеНДФЛ.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
			НачислениеНДФЛ.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
			НачислениеНДФЛ.МесяцНачисления = Объект.НалоговыйПериод;
			НачислениеНДФЛ.Ответственный = Объект.Ответственный;  
			НачислениеНДФЛ.ПодразделениеОрганизации = Объект.ОтборПодразделение;	
			СчетчикСтрокВДокументе = 0;
			
			НачислениеНДФЛ.Дата = Объект.ДатаФормированияДокументов;
			//уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(НачислениеНДФЛ);
		КонецЕсли;	
		
		//запись строки документа
		Если НЕ ТекСтрока.НБ = 0 Тогда
			СтрокаДокумента = НачислениеНДФЛ.Начисления.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.НомерСчета = ТекСтрока.ПС;
			#Вставка
			// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
			Если НЕ хм_Ускорение = Неопределено Тогда
				СтрокаДокумента.ПенсионныйДоговор = ТекСтрока.ПСВладелец;
			Иначе
			#КонецВставки
			СтрокаДокумента.ПенсионныйДоговор = ТекСтрока.ПС.Владелец;
			#Вставка
			КонецЕсли;
			#КонецВставки
			СтрокаДокумента.Участник = ТекСтрока.Участник;
			#Вставка
			// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
			Если НЕ хм_Ускорение = Неопределено Тогда
				СтрокаДокумента.ФизЛицо = ТекСтрока.Участникуп_ФизЛицо;
			Иначе
			#КонецВставки
			СтрокаДокумента.ФизЛицо = ТекСтрока.Участник.уп_ФизЛицо;
			#Вставка
			КонецЕсли;
			#КонецВставки
			СтрокаДокумента.Начисление = ТекСтрока.ВидНачисления;
			//СтрокаДокумента.КодДоходаНДФЛ = ТекСтрока.ВидНачисления.КодДоходаНДФЛ;
			СтрокаДокумента.Результат = ТекСтрока.НБ;
		КонецЕсли;
		
		Если Н = ТЗ.Количество()-1 Тогда
			НачислениеНДФЛ.Записать();
			//надо еще рассчитать его
			//НачислениеНДФЛ.РассчитатьНДФЛ();
			уп_РасчетНДФЛ.ЗаполнитьДокументНачисленияНДФЛ(НачислениеНДФЛ);
			НачислениеНДФЛ.Записать();
			
			НовоеНачисление = Объект.НовыеНачисления.Добавить();
			НовоеНачисление.Документ = НачислениеНДФЛ.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура НПФ_СформироватьПосле(Команда)
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Начисление налога завершено");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
&После("Провести")
Процедура НПФ_Провести(Команда)
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Проведение налога завершено");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры
